gap> ######################### BEGIN COPYRIGHT MESSAGE #########################
GBNP - computing Gröbner bases of noncommutative polynomials
Copyright 2001-2010 by Arjeh M. Cohen, Dié A.H. Gijsbers, Jan Willem
Knopper, Chris Krook. Address: Discrete Algebra and Geometry (DAM) group
at the Department of Mathematics and Computer Science of Eindhoven
University of Technology.

For acknowledgements see the manual. The manual can be found in several
formats in the doc subdirectory of the GBNP distribution. The
acknowledgements formatted as text can be found in the file chap0.txt.

GBNP is free software; you can redistribute it and/or modify it under
the terms of the Lesser GNU General Public License as published by the
Free Software Foundation (FSF); either version 2.1 of the License, or
(at your option) any later version. For details, see the file 'LGPL' in
the doc subdirectory of the GBNP distribution or see the FSF's own site:
https://www.gnu.org/licenses/lgpl.html
gap> ########################## END COPYRIGHT MESSAGE ##########################

gap> LoadPackage("gbnp", false);
true

BaseQA
gap> F:=Rationals;;
gap> NPone:=[[[]],[One(F)]];;
gap> BaseQA([NPone],0,0)=[];
true
gap> BaseQA([NPone],2,0)=[];
true
gap> BaseQA([],2,5);; # warning length is 7 !

DimQA
gap> DimQA([NPone],0)=0;
true
gap> DimQA([NPone],2)=0;
true

MatrixQA

MatricesQA

gap> MatricesQA(1,[],[[[[]],[1]]])=[[]];
true

gap> MatricesQA(1,[[[[]],[1]]],[[[[1]],[1]]])=[[[0]]];
true
gap> MatricesQA(1,[[[[]],[1]],[[[1]],[1]]],[[[[1,1]],[1]]])=[[[0,1],[0,0]]];
true
gap> MatricesQA(1,[[[[]],[1]],[[[1]],[1]]],[[[[1,1],[]],[1,-1]]])=[[[0,1],[1,0]]];
true

MulQA
gap> F:=Rationals;;
gap> NPone:=[[[]],[One(F)]];;
gap> NPzero:=[[],[]];;

gap> MulQA(NPone,NPone,[])=NPone;
true
gap> MulQA(NPzero,NPone,[])=NPzero;
true
gap> MulQA(NPone,NPzero,[])=NPzero;
true
gap> MulQA(NPzero,NPzero,[])=NPzero;
true
gap> MulQA(NPone,NPone,[NPzero])=NPone;
true
gap> MulQA(NPone,NPone,[NPone])=NPzero;
true

gap> F:=GF(2);;
gap> NPone:=[[[]],[One(F)]];;
gap> NPzero:=[[],[]];;

gap> MulQA(NPone,NPone,[])=NPone;
true
gap> MulQA(NPzero,NPone,[])=NPzero;
true
gap> MulQA(NPone,NPzero,[])=NPzero;
true
gap> MulQA(NPzero,NPzero,[])=NPzero;
true
gap> MulQA(NPone,NPone,[NPzero])=NPone;
true
gap> MulQA(NPone,NPone,[NPone])=NPzero;
true

StrongNormalFormNP
gap> StrongNormalFormNP(NPone,[])=NPone;
true
gap> StrongNormalFormNP(NPzero,[])=NPzero;
true
gap> StrongNormalFormNP(NPone,[NPzero])=NPone;
true
gap> StrongNormalFormNP(NPone,[NPone])=NPzero;
true
gap> StrongNormalFormNP(NPzero,[NPzero])=NPzero;
true
